webservice/JaxwsServiceConsumerProxy/resources/proxyservice.xml

<?xml version='1.0' encoding='UTF-8'?><wsdl:definitions xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:tns="http://support.cxf.module.mule.org/" xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:ns1="http://schemas.xmlsoap.org/soap/http" name="provider.LoginIntf" targetNamespace="http://support.cxf.module.mule.org/">
  <wsdl:types>
<xsd:schema xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://support.cxf.module.mule.org/" attributeFormDefault="unqualified" elementFormDefault="qualified" targetNamespace="http://support.cxf.module.mule.org/">
  <xsd:element name="invoke" type="tns:invoke"/>
  <xsd:complexType name="invoke">
    <xsd:sequence>
      <xsd:element minOccurs="0" name="arg0" type="xsd:anyType"/>
    </xsd:sequence>
  </xsd:complexType>
  <xsd:element name="invokeResponse" type="tns:invokeResponse"/>
  <xsd:complexType name="invokeResponse">
    <xsd:sequence>
      <xsd:element minOccurs="0" name="return" type="xsd:anyType"/>
    </xsd:sequence>
  </xsd:complexType>
</xsd:schema>
  </wsdl:types>
  <wsdl:message name="invokeResponse">
    <wsdl:part element="tns:invokeResponse" name="parameters">
    </wsdl:part>
  </wsdl:message>
  <wsdl:message name="invoke">
    <wsdl:part element="tns:invoke" name="parameters">
    </wsdl:part>
  </wsdl:message>
  <wsdl:portType name="ProxyServicePortType">
    <wsdl:operation name="invoke">
      <wsdl:input message="tns:invoke" name="invoke">
    </wsdl:input>
      <wsdl:output message="tns:invokeResponse" name="invokeResponse">
    </wsdl:output>
    </wsdl:operation>
  </wsdl:portType>
  <wsdl:binding name="provider.LoginIntfSoapBinding" type="tns:ProxyServicePortType">
    <soap12:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
    <wsdl:operation name="invoke">
      <soap12:operation soapAction="" style="document"/>
      <wsdl:input name="invoke">
        <soap12:body use="literal"/>
      </wsdl:input>
      <wsdl:output name="invokeResponse">
        <soap12:body use="literal"/>
      </wsdl:output>
    </wsdl:operation>
  </wsdl:binding>
  <wsdl:service name="provider.LoginIntf">
    <wsdl:port binding="tns:provider.LoginIntfSoapBinding" name="ProxyServicePort">
      <soap12:address location="http://localhost:8081/service"/>
    </wsdl:port>
  </wsdl:service>
</wsdl:definitions>