modules_cxf_src_test_java_org_mule_module_cxf_ProxyTestCase.java/[CN]/ProxyTestCase/[MT]/testProxyCDATA()/body

{
  String msg="<soapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:sup=\"http://support.cxf.module.mule.org/\">\n" + "<soapenv:Header/>\n" + "<soapenv:Body>\n"+ "<sup:invoke>\n"+ "<soapenv:Envelope>\n"+ "<soapenv:Header/>\n"+ "<soapenv:Body>\n"+ "<sup:invoke>\n"+ "<Request>\n"+ "<servicePayload><![CDATA[<soapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\"><soapenv:Header/><soapenv:Body><int:test/></soapenv:Body></soapenv:Envelope>]]></servicePayload>\n"+ "</Request>\n"+ "</sup:invoke>\n"+ "</soapenv:Body>\n"+ "</soapenv:Envelope>\n"+ "</sup:invoke>\n"+ "</soapenv:Body>\n"+ "</soapenv:Envelope>";
  MuleClient client=muleContext.getClient();
  MuleMessage result=client.send("http://localhost:" + dynamicPort.getNumber() + "/services/CDATAService",new DefaultMuleMessage(msg,muleContext));
  assertNotNull(result);
  assertTrue(result.getPayloadAsString().contains("![CDATA["));
}
